import { useState } from "react";
import img1 from "../assets/img/blog/iran-modern-design.jpg";
import img2 from "../assets/img/blog/nemayeh-classic.jpg";
import img3 from "../assets/img/blog/blog3.jpg";

const AllBlogData = () => {
  const blogsData = [
    {
      id: 1,
      img: img1,
      title: "تاریخچه نمای مدرن در ایران",
      date: "23 آبان 1401",
      tag: `مهندسی عمران، معماری`,
      descriptions: [
        "در دوره قاجار با باز شدن پای اشراف‌زاده‌های ایرانی به اروپا، صنعت ساختمانسازی دستخوش تغییرات عظیمی شد. ایرانی‌هایی که تا آن زمان تنها به خانه‌های تو در تو با سقف‌های هشتی و نمایی نه چندان تزئین شده عادت داشتند، شروع کردند به تقلید از اروپا و ساختمان‌سازی مدرن آنها را به معماری کلاسیک ایرانی پیوند زدن. اما آنچه بیش از همه به چشم آمد، تغییر در نمای ساختمان‌ها بود.",

        "در ایران تا اواخر قرن ۱۹ ارتباط خانه‌ها با نمای بیرون از طریق حیاط مرکزی صورت می‌گرفت و توجه بیشتر به نمای داخلی ساختمان بوده است. برای همین است که شما از دیدن فضای داخلی خانه‌های اشرافی به جا مانده از دوره قاجار بیشتر لذت میبرید تا نمای بیرونی. بعد از قرن ۲۰ با سفر ناصرالدین شاه به فرنگ تصمیم گرفته شد که ایران از نماهای اروپایی الگو برداری کنند.",

        "اولین تغییر این بود که خانه‌ها در حاشیه خیابان‌ها ساخته شدند. خانواده‌های ثروتمند که دیگر نمای ساختمان برایشان اهمیت پیدا کرده بود، حالا سعی می‌کردند چون اروپاییان، خانه‌هایشان را بر خیابان‌ها بسازند. این تغییرات در نمای ساختمان‌های ایرانی باعث شد خانه‌های درون‌گرای ایرانی کم‌کم به بیرون‌گرا تبدیل شوند. یعنی آنچه را تزئین محسوب می‌شد، بیشتر به بیرون از خانه ببرند و حالا  نمای ساختمان اهمیت ویژه‌ای پیدا کرده بود.",

        "نمای هر ساختمان در شکل دهی به مجموعه شهری که در آن واقع شده است خیلی مؤثر است. اگر به نمای یک ساختمان بدون در نظر گرفتن نمای دیگر ساختمان های شهر توجه کنیم می بینیم که یکنواختی نمای شهر در مجموع از بین می رود. نمای هر ساختمان تأثیر مستقیم بر شهری دارد که در آن قرار گرفته و تأثیر آن را در بدنه خیابان ها یا میدان های آن شهر می بینیم. تفاوت بین شهری بودن یا فردی بودن نما در صورتی از بین می رود که ساختمان جزئی از شهر در نظر گرفته شود و ارتباط آن با محیط اطراف خودش چند جانبه باشد."
      ]
    },
    {
      id: 2,
      img: img2,
      title: "تاریخچه نمای کلاسیک",
      date: "23 آبان 1401",
      tag: `نمای کلاسیک، مهنمدسی عمران، معماری`,
      descriptions: [
        "طراحی نما یکی از مهم ترین و البته جذاب ترین حوزه های معماری می باشد که امروز در سراسر جهان از اهمیت ویژه ای برخوردار است و زمان بسیاری برای انجام آن صرف می شود. همان طور که مستحضر هستید، نما اولین نقطه ای از ساختمان است که در نگاه اول نظر مخاطب را به خود جلب می کند و می تواند تاثیر بالایی در دید اولیه افراد نسبت به آن بنا داشته باشد. بسیاری معتقد هستند نما ویترین یک ساختمان است که اگر زیبایی و کارآمدی لازم را نداشته باشد در وهله اول به دید مخاطب ضربه زده، در وهله دوم از ارزش ملک می کاهد و در نهایت نیز زیبایی شهری را تحت تاثیر قرار می دهد. با توجه به سبک های معماری متعددی که وجود دارد، طراحی نما نیز به دنبال این سبک و تحت تاثیر از آنها سبک های خاص خودش را نیز پیدا نموده که از جمله پر کاربرد ترین این سبک های می توان به نمای مدرن و نمای کلاسیک اشاره نمود.",

        "همان طور که می دانیم با گذر زمان و در جهان امروزی به طراحی نما بسیار بیش از گذشته بها داده می شود و هزینه های هنگفتی نیز صرف امور مرتبط با طراحی نما می گردد که با توجه به موارد یاد شده و اهمیت بالای نما در ساختمان ها می توان گفت این صرف هزینه و زمانی که برای انجام این امور گذاشته می شود، توجیه پیدا می نماید. نمایی که از گذشته تا کنون در ایران طرفداران بسیاری داشته و دارد، نمای کلاسیک است چرا که به معماری سنتی نزدیک تر است و لوکس تر بودن آن نسبت به نماهای مدرن باعث گردیده تا علاقمندان و طرفداران خاص خودش را نیز داشته باشد.",
        "در ایران به دلیل اینکه حوزه نما دچار آشفتگی های فراوانی است، تعریف نمای کلاسیک دستخوش تغییراتی گردیده و هر زمان سخن از نمای کلاسیک به میان می اید در ذهن اکثریت مردم، نمای رومی تداعی می گردد. اما آیا نمای رومی همان نمای کلاسیک است و اینکه آیا این نما یک نمای وارد شده از خارج کشور است یا خیر؟",
        "در امپراطوری ایران باستان، نوعی از معماری مورد توجه بود که مشابه طراحی ساختمان های امروزی است. به طور مثال آثار به جای مانده از تخت جمشید و دیگر مکان های تاریخی ایران باستان همگی شامل عناصری مانند سرستون، مجسمه های سنگی، ستون های قطور و بلند و کتیبه های سنگی است. این عناصر معماری کلاسیک ایرانی با شاخصه های معماری روم باستان اشتراکات بسیاری دارند. به عبارت دیگر طراحی نما کلاسیک که امروزه با نام نمای رومی شناخته می شود، در راستای تاثیر فرهنگی به وجود آمده که دلیل اصلی آن درگیری های امپراطوری های شرق و غرب در زمان های دور بوده است. ورود نمای کلاسیک به ایران یک زمان مشخص دارد و پس از رواج یافتن شهرسازی مدرن مورد توجه قرار گرفته است چرا که تا قبل از آن طراحی ساختمان ها و معماری ایران طوری بود که از معماری بومی یا اقلیمی پیروی می نمود. آنچه امروز درباره نماهای ساختمان ها آزار دهنده شده است، عدم وجود هویت در طراحی نماهای ساختمان هاست و مهم ترین دغدغه برای طراحان معماری در ایران امروز تلفیق معماری سنتی ایرانی و عناصر آن با علم روز طراحی در عین حفظ عناصر هویتی معماری ایرانی است."
      ]
    },
    {
      id: 3,
      img: img3,
      title: "تاریخچه محوطه سازی",
      date: "27 آبان 1401",
      tag: `مهندسی معماری`,
      descriptions: [
        `
          برای یک طراحی محوطه خوب، ابتدا باید بدانید محوطه سازی چیست
            در محوطه سازی بیش تر به ترکیب و قرار دادن عناصر مختلف در محیط می پردازند.
            در واقع با این کار فضایی طبیعی که شامل نهر کوچک، درختان و گیاهان سر سبز، حوض آب، آلاچیق و … می باشد را خلق می شود.
            در علم معماری محوطه سازی به ترکیب چندین علوم پرداخته است که شامل زمین شناسی، باغبانی، گیاه شناسی و … می باشد.
            در واقع این علم از زمانی شروع به پیشرفت کرده است که رابطه ی انسان با طبیعت کم رنگ تر شد.
            برای ایجاد ارتباط و احساس آرامشی که طبیعت در انسان پدید می آورد، محوطه سازی وارد زندگی انسان ها شده است.
            علم معماری منظر یا محوطه سازی در ابعاد بزرگ نیز قابل بررسی می باشد و می توان در زمین هایی با متراژ بالاتر نیز از آن استفاده کرد.`,

          `علم محوطه سازی از شروع قرن 21 وارد عرصه معماری شده است.محوطه سازی با علمی که انسان به محیط پیرامون خود و درکی که از طبیعت دارد شکل گرفته است.
            در این علم سلامت روان و جسم انسان نیز در نظر گرفته شده است و با توجه به اکوسیستم زندگی و بوم شناسی تکمیل شده است.
            در معماری منظر به نوع متریال استفاده شده و سازه ها و محصولاتی که برای پیاده سازی پلان در نظر باید گرفت توجه می شود.
            در زیر به بررسی هر یک از المان های فوق می پردازیم`,

          `متریال:
          وقتی صحبت از متریال می شود دو نوع مورد استفاده وجود دارد.
          در نوع اول متریال هایی قرار دارند که در اجرای محوطه سازی مورد استفاده قرار می گیرند مثل چوب، خاک، شن و سنگ
          
          نوع دوم متریال هایی است که در ساخت محصولات مورد نیاز استفاده می شوند.
          مثل چوب برای ساخت چوب پلاست`,
          `محصولات:
            در اجرای محوطه سازی همیشه از محصولاتی استفاده می شود تا جلوه ی زیبا و طبیعی را به محیط ببخشد.
            مثل استفاده از آب، درختان و انواع گل و گیاهان
            
            اما در میان این ها آلاچیق ها از جلوه ی خاصی برخوردارند و به دلیل تنوع زیادی که در انتخاب آن ها وجود دارد می توان پلان های خاصی را با توجه به سلیقه و متراژ محیط اجرا پیاده سازی کرد.
            این نوع محصول بیش تر در محیط های باز استفاده می شود و به دلیل وجود چوب در ساختار آن نمایی زیبا و خواستنی، گرم و صمیمی به محوطه می بخشد`
      ]
    },


  ];

  const [blog, setBlog] = useState({});
  const [isOpen, setIsOpen] = useState(false);

  const openBlog = (id) => {
    const find = blogsData.find((item) => item?.id === id);
    setBlog(find);
    setIsOpen(true);
  };

  return {
    blog,
    isOpen,
    setIsOpen,
    blogsData,
    openBlog,
  };
};

export default AllBlogData;
